[NoCoverage] StringLiteral
src/UI/app.ts:15:28
     document.querySelector("#TotalCaracteres")!.textContent=resultado.characterCount.toString();
     document.querySelector("#TotalOraciones")!.textContent=resultado.sentenceCount.toString();
     document.querySelector("#TotalParrafos")!.textContent=resultado.paragraphCount.toString();
-    document.querySelector("#MediaPalabras")!.textContent=resultado.averageWordLength.toString();
+    document.querySelector("")!.textContent=resultado.averageWordLength.toString();
     document.querySelector("#MediaPalabrasOracion")!.textContent=resultado.averageSentenceLength.toString();
     // document.querySelector("#PalabrasPrincipales")!.textContent=resultado.wordFrequency.toString();

[NoCoverage] StringLiteral
src/UI/app.ts:16:28
     document.querySelector("#TotalOraciones")!.textContent=resultado.sentenceCount.toString();
     document.querySelector("#TotalParrafos")!.textContent=resultado.paragraphCount.toString();
     document.querySelector("#MediaPalabras")!.textContent=resultado.averageWordLength.toString();
-    document.querySelector("#MediaPalabrasOracion")!.textContent=resultado.averageSentenceLength.toString();
+    document.querySelector("")!.textContent=resultado.averageSentenceLength.toString();
     // document.querySelector("#PalabrasPrincipales")!.textContent=resultado.wordFrequency.toString();
 

[NoCoverage] ConditionalExpression
src/UI/app.ts:27:69
     const ArrayPalabras: [string, number][] = Array.from(resultado.wordFrequency);
 
         // Filtra palabras que aparecen más de 2 veces
-        const ArrayFrecuencia = ArrayPalabras.filter(([_, freq]) => freq > 3);
+        const ArrayFrecuencia = ArrayPalabras.filter(([_, freq]) => false);
 
         //Esto es un bubble sort descendente (De Mayor a menor)

[NoCoverage] MethodExpression
src/UI/app.ts:27:33
     const ArrayPalabras: [string, number][] = Array.from(resultado.wordFrequency);
 
         // Filtra palabras que aparecen más de 2 veces
-        const ArrayFrecuencia = ArrayPalabras.filter(([_, freq]) => freq > 3);
+        const ArrayFrecuencia = ArrayPalabras;
 
         //Esto es un bubble sort descendente (De Mayor a menor)

[NoCoverage] ConditionalExpression
src/UI/app.ts:30:23
         const ArrayFrecuencia = ArrayPalabras.filter(([_, freq]) => freq > 3);
 
         //Esto es un bubble sort descendente (De Mayor a menor)
-        for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
+        for (let i=0; false; ++i){
             for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
 

[NoCoverage] UpdateOperator
src/UI/app.ts:30:53
         const ArrayFrecuencia = ArrayPalabras.filter(([_, freq]) => freq > 3);
 
         //Esto es un bubble sort descendente (De Mayor a menor)
-        for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
+        for (let i=0; i<ArrayFrecuencia.length - 1; --i){
             for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
 

[NoCoverage] EqualityOperator
src/UI/app.ts:31:28
 
         //Esto es un bubble sort descendente (De Mayor a menor)
         for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
-            for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
+            for(let j = 0; j <= ArrayFrecuencia.length - i - 1; ++j){
 
                 if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {

[NoCoverage] ConditionalExpression
src/UI/app.ts:31:28
 
         //Esto es un bubble sort descendente (De Mayor a menor)
         for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
-            for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
+            for(let j = 0; false; ++j){
 
                 if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {

[NoCoverage] BlockStatement
src/UI/app.ts:33:72
         for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
             for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
 
-                if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {
-                    const temp = ArrayFrecuencia[j]!
-                    ArrayFrecuencia[j] = ArrayFrecuencia[j+1]!;
-                    ArrayFrecuencia[j+1] = temp;
-                }
+                if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {}
             }
         }

[NoCoverage] EqualityOperator
src/UI/app.ts:33:21
         for (let i=0; i<ArrayFrecuencia.length - 1; ++i){
             for(let j = 0; j < ArrayFrecuencia.length - i - 1; ++j){
 
-                if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {
+                if (ArrayFrecuencia[j]![1] <= ArrayFrecuencia[j + 1]![1]) {
                     const temp = ArrayFrecuencia[j]!
                     ArrayFrecuencia[j] = ArrayFrecuencia[j+1]!;

[NoCoverage] ArithmeticOperator
src/UI/app.ts:35:58
 
                 if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {
                     const temp = ArrayFrecuencia[j]!
-                    ArrayFrecuencia[j] = ArrayFrecuencia[j+1]!;
+                    ArrayFrecuencia[j] = ArrayFrecuencia[j - 1]!;
                     ArrayFrecuencia[j+1] = temp;
                 }

[NoCoverage] ArithmeticOperator
src/UI/app.ts:36:37
                 if (ArrayFrecuencia[j]![1] < ArrayFrecuencia[j+1]![1]) {
                     const temp = ArrayFrecuencia[j]!
                     ArrayFrecuencia[j] = ArrayFrecuencia[j+1]!;
-                    ArrayFrecuencia[j+1] = temp;
+                    ArrayFrecuencia[j - 1] = temp;
                 }
             }

[NoCoverage] BlockStatement
src/UI/app.ts:41:52
             }
         }
         //imprime el array ordenado con el bubble sort
-        for (const [word, freq] of ArrayFrecuencia){
-            const li = document.createElement("li");
-            li.innerHTML = `   <strong>${word}</strong> (x${freq})`;
-            PalabrasClave.appendChild(li);
-        }
+        for (const [word, freq] of ArrayFrecuencia){}
 }
 

[NoCoverage] BlockStatement
src/UI/app.ts:51:42
 const textarea = document.querySelector(".texto") as HTMLTextAreaElement;
 
 // Actualiza la salida, cada vez que se ingresa texto
-textarea.addEventListener("input", () => {
-    actualizarEstadisticas(textarea.value)
-})
+textarea.addEventListener("input", () => {})
 
 
