[Killed] BlockStatement
src/modules/Analizador.ts:9:60
  * @param text Texto a analizar.
  * @returns Un objeto con las estadísticas del texto.
  */
-export function AnalizarTexto(text:string): TextStatistics {
-    return {
-        characterCount: ContarCaracteres(text),
-
-        characterCountNoSpaces: ContarCaracteresSinSpacio(text),
-
-        wordCount: ContarPalabras(text),
-
-        sentenceCount: ContarOraciones(text),
-
-        paragraphCount: ContarParrafos(text),
-
-        averageWordLength: LongitudMediaPalabras(text),
-
-        averageSentenceLength: NumeroMedioPalabrasOracion(text),
-
-        wordFrequency: FrecuenciaPalabras(text)
-    }
-}
+export function AnalizarTexto(text:string): TextStatistics {}
     //*CONTADORES
     /**
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: Cannot read properties of undefined (reading 'characterCount')

[Killed] ObjectLiteral
src/modules/Analizador.ts:10:12
  * @returns Un objeto con las estadísticas del texto.
  */
 export function AnalizarTexto(text:string): TextStatistics {
-    return {
-        characterCount: ContarCaracteres(text),
-
-        characterCountNoSpaces: ContarCaracteresSinSpacio(text),
-
-        wordCount: ContarPalabras(text),
-
-        sentenceCount: ContarOraciones(text),
-
-        paragraphCount: ContarParrafos(text),
-
-        averageWordLength: LongitudMediaPalabras(text),
-
-        averageSentenceLength: NumeroMedioPalabrasOracion(text),
-
-        wordFrequency: FrecuenciaPalabras(text)
-    }
+    return {}
 }
     //*CONTADORES
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:34:53
      * @param text Texto a analizar.
      * @returns Número de caracteres.
      */
-    function ContarCaracteres(text: string): number {
-        return text.length;
-    }
+    function ContarCaracteres(text: string): number {}
 
     /**
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:43:62
      * @param text Texto a analizar.
      * @returns Número de caracteres sin espacios.
      */
-    function ContarCaracteresSinSpacio(text: string): number {
-        return text.replace(/\s/g, '').length;
-        // "/, 'inicia una expresion regular',\s => todos los espacios en blanco, pero solo los cuenta 1na vez por defecto 'g'=> global, TODOS los espacios en blanco"
-        // todos los espacios en blanco seran reemplazados por un ''
-    }
+    function ContarCaracteresSinSpacio(text: string): number {}
 
     /**
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] StringLiteral
src/modules/Analizador.ts:44:36
      * @returns Número de caracteres sin espacios.
      */
     function ContarCaracteresSinSpacio(text: string): number {
-        return text.replace(/\s/g, '').length;
+        return text.replace(/\s/g, "Stryker was here!").length;
         // "/, 'inicia una expresion regular',\s => todos los espacios en blanco, pero solo los cuenta 1na vez por defecto 'g'=> global, TODOS los espacios en blanco"
         // todos los espacios en blanco seran reemplazados por un ''
killedBy: Pruebas del Analizador Conteo de caracteres Solo espacios
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 51

[Killed] Regex
src/modules/Analizador.ts:44:29
      * @returns Número de caracteres sin espacios.
      */
     function ContarCaracteresSinSpacio(text: string): number {
-        return text.replace(/\s/g, '').length;
+        return text.replace(/\S/g, '').length;
         // "/, 'inicia una expresion regular',\s => todos los espacios en blanco, pero solo los cuenta 1na vez por defecto 'g'=> global, TODOS los espacios en blanco"
         // todos los espacios en blanco seran reemplazados por un ''
killedBy: Pruebas del Analizador Conteo de caracteres Solo espacios
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 3

[Killed] BlockStatement
src/modules/Analizador.ts:54:50
      * @param text Texto a analizar.
      * @returns Número de palabras.
      */
-    function ContarPalabras(text: string): number{
-        const palabras = text.match(/\b\w+\b/g) || [];
-        // const palabras = text.trim().split(/\s+/).filter(Boolean); // Con un filter(boolean), filtro todos caracteres/palabras vacias
-        // recuerda todo el resultado del split se pasa a un array
-        return palabras.length;
-    }
+    function ContarPalabras(text: string): number{}
 
     /**
killedBy: Pruebas del Analizador Conteo de palabras Texto vacío
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:71:52
      * @param text - El texto en el que se desea contar las oraciones.
      * @returns El número de oraciones encontradas en el texto.
      */
-    function ContarOraciones(text: string): number {
-        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length > 0);
-        // Con text.split
-            // => /[.!?+/] => '.!?+' divide las oraciones en partes, con caracteres que terminen en '.', '!', o '?'
-            //         , el '+', es para que no halla redundancia entre los caracteres
-        // Con el filter( s => s.trim().length > 0)
-            // realiza un filtrado, se pasa la oracion, a un trim(), para quitar los espacios en blanco al inicio y al final
-            // , luego, se verifica que la oracion, no sea una oracion vacia con > 0, si lo es, no lo añade al nuevo array de cadenas filtradas
-        return oraciones.length;
-    }
+    function ContarOraciones(text: string): number {}
 
     /**
killedBy: Pruebas del Analizador Conteo de oraciones Texto con varias oraciones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/modules/Analizador.ts:72:61
      * @returns El número de oraciones encontradas en el texto.
      */
     function ContarOraciones(text: string): number {
-        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length > 0);
+        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length <= 0);
         // Con text.split
             // => /[.!?+/] => '.!?+' divide las oraciones en partes, con caracteres que terminen en '.', '!', o '?'
killedBy: Pruebas del Analizador Conteo de oraciones Texto con varias oraciones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/modules/Analizador.ts:88:51
     * @param text Texto a analizar.
     * @returns Número de párrafos.
     */
-    function ContarParrafos(text: string): number {
-        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
-        // En este caso, con '\n{2,}' => una nueva linea, no usamos '+', por que se especifica que debe excluir desde 2 o mas saltos lineas,
-        // => ya que si solo usamos '+', incluira las oraciones normales que solo poseen un salto de linea
-        return parrafos.length;
-    }
+    function ContarParrafos(text: string): number {}
 
 
killedBy: Pruebas del Analizador Conteo de parrafos Texto con varios parrafos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/modules/Analizador.ts:89:59
     * @returns Número de párrafos.
     */
     function ContarParrafos(text: string): number {
-        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
+        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length >= 0);
         // En este caso, con '\n{2,}' => una nueva linea, no usamos '+', por que se especifica que debe excluir desde 2 o mas saltos lineas,
         // => ya que si solo usamos '+', incluira las oraciones normales que solo poseen un salto de linea
killedBy: Pruebas del Analizador Conteo de parrafos Texto con varios parrafos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/modules/Analizador.ts:106:59
      * @param text - El texto sobre el cual se calculará la longitud media de las palabras.
      * @returns La longitud media de las palabras en el texto. Si no hay palabras, retorna 0.
      */
-    function LongitudMediaPalabras (text: string): number {
-
-        const word = text.match(/\b\w+\b/g) || []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
-        // Con match, sacamos las palabras dentro del texto \b \b -> indica el inicio y fin de la palabra en extraccion
-        // \w divide por caracteres, si le agregamos '+', 1 o mas caracteres, (para que filtre por palabras y no caracteres)
-        // Este metodo es mas preciso que el del split, pero mas lento...?
-
-        // verificador
-        if (word.length === 0) return 0;
-
-        const totalLength = word.reduce((sum, w) => sum + w.length, 0);
-        // en la funcion reduce (callback), sum es un acumulador y w es un valor a agregar al acumulador,
-        // basicamente, sum, es como un for each, pero mas abreviado., 0 tomara el valor del acumulador,
-        // la funcion retornara el valor acumulado.
-        // recuerda que word, es un array, reduce llama a la funcion por cada palabra dentro del array
-
-        return parseFloat((totalLength/word.length).toFixed(1)); // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
-    }
+    function LongitudMediaPalabras (text: string): number {}
 
 
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: TypeError: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/modules/Analizador.ts:108:22
      */
     function LongitudMediaPalabras (text: string): number {
 
-        const word = text.match(/\b\w+\b/g) || []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
+        const word = true; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
         // Con match, sacamos las palabras dentro del texto \b \b -> indica el inicio y fin de la palabra en extraccion
         // \w divide por caracteres, si le agregamos '+', 1 o mas caracteres, (para que filtre por palabras y no caracteres)
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: word.reduce is not a function

[Killed] ConditionalExpression
src/modules/Analizador.ts:114:13
         // Este metodo es mas preciso que el del split, pero mas lento...?
 
         // verificador
-        if (word.length === 0) return 0;
+        if (false) return 0;
 
         const totalLength = word.reduce((sum, w) => sum + w.length, 0);
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ArithmeticOperator
src/modules/Analizador.ts:122:28
         // la funcion retornara el valor acumulado.
         // recuerda que word, es un array, reduce llama a la funcion por cada palabra dentro del array
 
-        return parseFloat((totalLength/word.length).toFixed(1)); // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
+        return parseFloat((totalLength * word.length).toFixed(1)); // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
     }
 
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: 16

Expected precision:    2
Expected difference: < 0.005
Received difference:   12

[Killed] BlockStatement
src/modules/Analizador.ts:131:62
      * @param text Texto a analizar.
      * @returns Número medio de palabras por oración.
      */
-    function NumeroMedioPalabrasOracion(text:string): number {
-
-        // Oraciones
-        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length > 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
-        // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
-
-        // verificador
-        if (sentences.length === 0) return 0;
-
-        // Total de palabras de las oraciones
-        const words = text.match(/\b\w+\b/g) || [];
-
-
-        // Total de palabras / numero de oraciones
-        return parseFloat((words.length / sentences.length).toFixed(1)); // Numero medio de palabras por oracion
-    }
+    function NumeroMedioPalabrasOracion(text:string): number {}
 
     //* FRECUENCIA
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: TypeError: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] EqualityOperator
src/modules/Analizador.ts:134:61
     function NumeroMedioPalabrasOracion(text:string): number {
 
         // Oraciones
-        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length > 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
+        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length <= 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] ConditionalExpression
src/modules/Analizador.ts:138:13
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
         // verificador
-        if (sentences.length === 0) return 0;
+        if (false) return 0;
 
         // Total de palabras de las oraciones
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ArithmeticOperator
src/modules/Analizador.ts:145:28
 
 
         // Total de palabras / numero de oraciones
-        return parseFloat((words.length / sentences.length).toFixed(1)); // Numero medio de palabras por oracion
+        return parseFloat((words.length * sentences.length).toFixed(1)); // Numero medio de palabras por oracion
     }
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 8

Expected precision:    2
Expected difference: < 0.005
Received difference:   6

[Killed] BlockStatement
src/modules/Analizador.ts:155:67
      * @param text Texto a analizar.
      * @returns Mapa con la frecuencia de cada palabra.
      */
-    function FrecuenciaPalabras(text: string): Map<string, number>{
-
-        const words = text.toLowerCase().match(/\b\w+\b/g) || [];
-
-        const freq = new Map<string, number>();
-
-        for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
-            // actualiza el valor de la clave dentro del mapeo de las palabras
-            // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
-            // Si se encuentra la palabra dentro del mapa, se añade 1 (ya que encontraste otra palabra igual).
-        }
-
-        return freq; // Retorna un mapeo clave-valor de (palabra->(ºn)frecuencia)
-    }
+    function FrecuenciaPalabras(text: string): Map<string, number>{}
     
     
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] ConditionalExpression
src/modules/Analizador.ts:157:23
      */
     function FrecuenciaPalabras(text: string): Map<string, number>{
 
-        const words = text.toLowerCase().match(/\b\w+\b/g) || [];
+        const words = false;
 
         const freq = new Map<string, number>();
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: words is not iterable

[Killed] LogicalOperator
src/modules/Analizador.ts:162:29
         const freq = new Map<string, number>();
 
         for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
+            freq.set(word, (freq.get(word) && 0)+ 1);
             // actualiza el valor de la clave dentro del mapeo de las palabras
             // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN
