[Killed] BlockStatement
src/modules/Analizador.ts:4:60
 import type { TextStatistics } from "../types/TextStatistics";
 
 //* FUNCION PRINCIPAL
-export function AnalizarTexto(text:string): TextStatistics {
-    return {
-        characterCount: ContarCaracteres(text),
-
-        characterCountNoSpaces: ContarCaracteresSinSpacio(text),
-
-        wordCount: ContarPalabras(text),
-
-        sentenceCount: ContarOraciones(text),
-
-        paragraphCount: ContarParrafos(text),
-
-        averageWordLength: LongitudMediaPalabras(text),
-
-        averageSentenceLength: NumeroMedioPalabrasOracion(text),
-
-        wordFrequency: FrecuenciaPalabras(text)
-    }
-}
+export function AnalizarTexto(text:string): TextStatistics {}
     //*CONTADORES
     // Todas las funciones, retornan un array de elementos en cadena,
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: Cannot read properties of undefined (reading 'characterCount')

[Killed] BlockStatement
src/modules/Analizador.ts:27:53
     // Todas las funciones, retornan un array de elementos en cadena,
     // con el .length, se cuenta el numero de elementos que contiene el array, en este caso (los caracteres/palabras/oraciones/etc )
 
-    function ContarCaracteres(text: string): number {
-        return text.length;
-    }
+    function ContarCaracteres(text: string): number {}
 
     function ContarCaracteresSinSpacio(text: string): number {
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:31:62
         return text.length;
     }
 
-    function ContarCaracteresSinSpacio(text: string): number {
-        return text.replace(/\s/g, '').length;
-        // "/, 'inicia una expresion regular',\s => todos los espacios en blanco, pero solo los cuenta 1na vez por defecto 'g'=> global, TODOS los espacios en blanco"
-        // todos los espacios en blanco seran reemplazados por un ''
-    }
+    function ContarCaracteresSinSpacio(text: string): number {}
 
     //FIXME
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:38:50
     }
 
     //FIXME
-    function ContarPalabras(text: string): number{
-        const palabras = text.match(/\b\w+\b/g) || [];
-        // const palabras = text.trim().split(/\s+/).filter(Boolean); // Con un filter(boolean), filtro todos caracteres/palabras vacias
-        // recuerda todo el resultado del split se pasa a un array
-        return palabras.length;
-    }
+    function ContarPalabras(text: string): number{}
 
     function ContarOraciones(text: string): number {
killedBy: Pruebas del Analizador Conteo de palabras Texto vacío
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] LogicalOperator
src/modules/Analizador.ts:39:26
 
     //FIXME
     function ContarPalabras(text: string): number{
-        const palabras = text.match(/\b\w+\b/g) || [];
+        const palabras = text.match(/\b\w+\b/g) && [];
         // const palabras = text.trim().split(/\s+/).filter(Boolean); // Con un filter(boolean), filtro todos caracteres/palabras vacias
         // recuerda todo el resultado del split se pasa a un array
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/modules/Analizador.ts:39:26
 
     //FIXME
     function ContarPalabras(text: string): number{
-        const palabras = text.match(/\b\w+\b/g) || [];
+        const palabras = true;
         // const palabras = text.trim().split(/\s+/).filter(Boolean); // Con un filter(boolean), filtro todos caracteres/palabras vacias
         // recuerda todo el resultado del split se pasa a un array
killedBy: Pruebas del Analizador Conteo de palabras Texto vacío
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:45:52
         return palabras.length;
     }
 
-    function ContarOraciones(text: string): number {
-        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length > 0);
-        // Con text.split
-            // => /[.!?+/] => '.!?+' divide las oraciones en partes, con caracteres que terminen en '.', '!', o '?'
-            //         , el '+', es para que no halla redundancia entre los caracteres
-        // Con el filter( s => s.trim().length > 0)
-            // realiza un filtrado, se pasa la oracion, a un trim(), para quitar los espacios en blanco al inicio y al final
-            // , luego, se verifica que la oracion, no sea una oracion vacia con > 0, si lo es, no lo añade al nuevo array de cadenas filtradas
-        return oraciones.length;
-    }
+    function ContarOraciones(text: string): number {}
 
     function ContarParrafos(text: string): number {
killedBy: Pruebas del Analizador Conteo de oraciones Texto con varias oraciones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/modules/Analizador.ts:46:61
     }
 
     function ContarOraciones(text: string): number {
-        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length > 0);
+        const oraciones = text.split(/[.!?]+/).filter( o => false);
         // Con text.split
             // => /[.!?+/] => '.!?+' divide las oraciones en partes, con caracteres que terminen en '.', '!', o '?'
killedBy: Pruebas del Analizador Conteo de oraciones Texto con varias oraciones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/modules/Analizador.ts:46:61
     }
 
     function ContarOraciones(text: string): number {
-        const oraciones = text.split(/[.!?]+/).filter( o => o.trim().length > 0);
+        const oraciones = text.split(/[.!?]+/).filter( o => true);
         // Con text.split
             // => /[.!?+/] => '.!?+' divide las oraciones en partes, con caracteres que terminen en '.', '!', o '?'
killedBy: Pruebas del Analizador Conteo de oraciones Texto con varias oraciones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/modules/Analizador.ts:56:51
         return oraciones.length;
     }
 
-    function ContarParrafos(text: string): number {
-        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
-        // En este caso, con '\n{2,}' => una nueva linea, no usamos '+', por que se especifica que debe excluir desde 2 o mas saltos lineas,
-        // => ya que si solo usamos '+', incluira las oraciones normales que solo poseen un salto de linea
-        return parrafos.length;
-    }
+    function ContarParrafos(text: string): number {}
 
 
killedBy: Pruebas del Analizador Conteo de parrafos Texto con varios parrafos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/modules/Analizador.ts:57:59
     }
 
     function ContarParrafos(text: string): number {
-        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
+        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length <= 0);
         // En este caso, con '\n{2,}' => una nueva linea, no usamos '+', por que se especifica que debe excluir desde 2 o mas saltos lineas,
         // => ya que si solo usamos '+', incluira las oraciones normales que solo poseen un salto de linea
killedBy: Pruebas del Analizador Conteo de parrafos Texto con varios parrafos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/modules/Analizador.ts:57:59
     }
 
     function ContarParrafos(text: string): number {
-        const parrafos = text.split(/\n{2,}/).filter(p => p.trim().length > 0);
+        const parrafos = text.split(/\n{2,}/).filter(p => false);
         // En este caso, con '\n{2,}' => una nueva linea, no usamos '+', por que se especifica que debe excluir desde 2 o mas saltos lineas,
         // => ya que si solo usamos '+', incluira las oraciones normales que solo poseen un salto de linea
killedBy: Pruebas del Analizador Conteo de parrafos Texto con varios parrafos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/modules/Analizador.ts:65:59
 
 
     //* LONGITUD MEDIA
-    function LongitudMediaPalabras (text: string): number {
-
-        const word = text.match(/\b\w+\b/g) || []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
-        // Con match, sacamos las palabras dentro del texto \b \b -> indica el inicio y fin de la palabra en extraccion
-        // \w divide por caracteres, si le agregamos '+', 1 o mas caracteres, (para que filtre por palabras y no caracteres)
-        // Este metodo es mas preciso que el del split, pero mas lento...?
-
-        // verificador
-        if (word.length === 0) return 0;
-
-        const totalLength = word.reduce((sum, w) => sum + w.length, 0);
-        // en la funcion reduce (callback), sum es un acumulador y w es un valor a agregar al acumulador, 
-        // basicamente, sum, es como un for each, pero mas abreviado., 0 tomara el valor del acumulador,
-        // la funcion retornara el valor acumulado.
-        // recuerda que word, es un array, reduce llama a la funcion por cada palabra dentro del array
-
-        return totalLength/word.length; // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
-    }
+    function LongitudMediaPalabras (text: string): number {}
 
     function NumeroMedioPalabrasOracion(text:string): number {
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: TypeError: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] LogicalOperator
src/modules/Analizador.ts:67:22
     //* LONGITUD MEDIA
     function LongitudMediaPalabras (text: string): number {
 
-        const word = text.match(/\b\w+\b/g) || []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
+        const word = text.match(/\b\w+\b/g) && []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
         // Con match, sacamos las palabras dentro del texto \b \b -> indica el inicio y fin de la palabra en extraccion
         // \w divide por caracteres, si le agregamos '+', 1 o mas caracteres, (para que filtre por palabras y no caracteres)
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/modules/Analizador.ts:67:22
     //* LONGITUD MEDIA
     function LongitudMediaPalabras (text: string): number {
 
-        const word = text.match(/\b\w+\b/g) || []; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
+        const word = false; // si ninguna entrada encaja dentro de la expresion regular, retorna un array vacio
         // Con match, sacamos las palabras dentro del texto \b \b -> indica el inicio y fin de la palabra en extraccion
         // \w divide por caracteres, si le agregamos '+', 1 o mas caracteres, (para que filtre por palabras y no caracteres)
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: word.reduce is not a function

[Killed] EqualityOperator
src/modules/Analizador.ts:73:13
         // Este metodo es mas preciso que el del split, pero mas lento...?
 
         // verificador
-        if (word.length === 0) return 0;
+        if (word.length !== 0) return 0;
 
         const totalLength = word.reduce((sum, w) => sum + w.length, 0);
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   4

[Killed] ConditionalExpression
src/modules/Analizador.ts:73:13
         // Este metodo es mas preciso que el del split, pero mas lento...?
 
         // verificador
-        if (word.length === 0) return 0;
+        if (true) return 0;
 
         const totalLength = word.reduce((sum, w) => sum + w.length, 0);
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   4

[Killed] ArithmeticOperator
src/modules/Analizador.ts:75:53
         // verificador
         if (word.length === 0) return 0;
 
-        const totalLength = word.reduce((sum, w) => sum + w.length, 0);
+        const totalLength = word.reduce((sum, w) => sum - w.length, 0);
         // en la funcion reduce (callback), sum es un acumulador y w es un valor a agregar al acumulador, 
         // basicamente, sum, es como un for each, pero mas abreviado., 0 tomara el valor del acumulador,
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: -4

Expected precision:    2
Expected difference: < 0.005
Received difference:   8

[Killed] ArrowFunction
src/modules/Analizador.ts:75:41
         // verificador
         if (word.length === 0) return 0;
 
-        const totalLength = word.reduce((sum, w) => sum + w.length, 0);
+        const totalLength = word.reduce(() => undefined, 0);
         // en la funcion reduce (callback), sum es un acumulador y w es un valor a agregar al acumulador, 
         // basicamente, sum, es como un for each, pero mas abreviado., 0 tomara el valor del acumulador,
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: NaN

Expected precision:    2
Expected difference: < 0.005
Received difference:   NaN

[Killed] ArithmeticOperator
src/modules/Analizador.ts:81:16
         // la funcion retornara el valor acumulado.
         // recuerda que word, es un array, reduce llama a la funcion por cada palabra dentro del array
 
-        return totalLength/word.length; // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
+        return totalLength * word.length; // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
     }
 
killedBy: Pruebas del Analizador Longitud media de palabras Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 4
Received: 16

Expected precision:    2
Expected difference: < 0.005
Received difference:   12

[Killed] BlockStatement
src/modules/Analizador.ts:84:62
         return totalLength/word.length; // Retorna el promedio dividiendo por la longitud acumulada y el numero total de palabras en el array
     }
 
-    function NumeroMedioPalabrasOracion(text:string): number {
-
-        // Oraciones
-        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length > 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
-        // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
-
-        // verificador
-        if (sentences.length === 0) return 0;
-
-        // Total de palabras de las oraciones
-        const words = text.match(/\b\w+\b/g) || [];
-
-
-        // Total de palabras / numero de oraciones
-        return words.length / sentences.length; // Numero medio de palabras por oracion
-    }
+    function NumeroMedioPalabrasOracion(text:string): number {}
 
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: TypeError: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArrowFunction
src/modules/Analizador.ts:87:56
     function NumeroMedioPalabrasOracion(text:string): number {
 
         // Oraciones
-        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length > 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
+        const sentences = text.split(/[.!?]+/).filter( () => undefined); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] ConditionalExpression
src/modules/Analizador.ts:87:61
     function NumeroMedioPalabrasOracion(text:string): number {
 
         // Oraciones
-        const sentences = text.split(/[.!?]+/).filter( s => s.trim().length > 0); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
+        const sentences = text.split(/[.!?]+/).filter( s => false); // [.!?] => conjunto de 1 signo de puntuacion o '+'mas...
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] EqualityOperator
src/modules/Analizador.ts:91:13
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
         // verificador
-        if (sentences.length === 0) return 0;
+        if (sentences.length !== 0) return 0;
 
         // Total de palabras de las oraciones
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] ConditionalExpression
src/modules/Analizador.ts:91:13
         // divide las oraciones entre signos de puntuacion, de ahi las valida si realmente son oraciones y las añade a un array.
 
         // verificador
-        if (sentences.length === 0) return 0;
+        if (true) return 0;
 
         // Total de palabras de las oraciones
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] LogicalOperator
src/modules/Analizador.ts:94:23
         if (sentences.length === 0) return 0;
 
         // Total de palabras de las oraciones
-        const words = text.match(/\b\w+\b/g) || [];
+        const words = text.match(/\b\w+\b/g) && [];
 
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 0

Expected precision:    2
Expected difference: < 0.005
Received difference:   2

[Killed] ConditionalExpression
src/modules/Analizador.ts:94:23
         if (sentences.length === 0) return 0;
 
         // Total de palabras de las oraciones
-        const words = text.match(/\b\w+\b/g) || [];
+        const words = true;
 
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: NaN

Expected precision:    2
Expected difference: < 0.005
Received difference:   NaN

[Killed] ArithmeticOperator
src/modules/Analizador.ts:98:16
 
 
         // Total de palabras / numero de oraciones
-        return words.length / sentences.length; // Numero medio de palabras por oracion
+        return words.length * sentences.length; // Numero medio de palabras por oracion
     }
 
killedBy: Pruebas del Analizador Numero medio de palabras por oracion Texto normal
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 2
Received: 8

Expected precision:    2
Expected difference: < 0.005
Received difference:   6

[Killed] BlockStatement
src/modules/Analizador.ts:103:67
 
 
     //* FRECUENCIA
-    function FrecuenciaPalabras(text: string): Map<string, number>{
-
-        const words = text.toLowerCase().match(/\b\w+\b/g) || [];
-
-        const freq = new Map<string, number>();
-
-        for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
-            // actualiza el valor de la clave dentro del mapeo de las palabras
-            // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
-            // Si se encuentra la palabra dentro del mapa, se añade 1 (ya que encontraste otra palabra igual).
-        }
-
-        return freq; // Retorna un mapeo clave-valor de (palabra->(ºn)frecuencia)
-    }
+    function FrecuenciaPalabras(text: string): Map<string, number>{}
     
     
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] LogicalOperator
src/modules/Analizador.ts:105:23
     //* FRECUENCIA
     function FrecuenciaPalabras(text: string): Map<string, number>{
 
-        const words = text.toLowerCase().match(/\b\w+\b/g) || [];
+        const words = text.toLowerCase().match(/\b\w+\b/g) && [];
 
         const freq = new Map<string, number>();
killedBy: Pruebas del Analizador Conteo de caracteres Texto vacio
statusReason: TypeError: words is not iterable

[Killed] MethodExpression
src/modules/Analizador.ts:105:23
     //* FRECUENCIA
     function FrecuenciaPalabras(text: string): Map<string, number>{
 
-        const words = text.toLowerCase().match(/\b\w+\b/g) || [];
+        const words = text.toUpperCase().match(/\b\w+\b/g) || [];
 
         const freq = new Map<string, number>();
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/modules/Analizador.ts:109:34
 
         const freq = new Map<string, number>();
 
-        for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
-            // actualiza el valor de la clave dentro del mapeo de las palabras
-            // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
-            // Si se encuentra la palabra dentro del mapa, se añade 1 (ya que encontraste otra palabra igual).
-        }
+        for (const word of words){}
 
         return freq; // Retorna un mapeo clave-valor de (palabra->(ºn)frecuencia)
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/modules/Analizador.ts:110:28
         const freq = new Map<string, number>();
 
         for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
+            freq.set(word, (freq.get(word) || 0) - 1);
             // actualiza el valor de la clave dentro del mapeo de las palabras
             // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3

[Killed] ConditionalExpression
src/modules/Analizador.ts:110:29
         const freq = new Map<string, number>();
 
         for (const word of words){
-            freq.set(word, (freq.get(word) || 0)+ 1);
+            freq.set(word, (false)+ 1);
             // actualiza el valor de la clave dentro del mapeo de las palabras
             // Si NO se encuentra la palabra dentro del mapa, se añade 1 (ya que se esta ingresando la palabra)
killedBy: Pruebas del Analizador Conteo de palabras Texto con mayusculas y minusculas
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1
